[
  {
    "path": "posts/2022-07-18-senate-majority-minority/",
    "title": "A look at MA State Senate Redistricting",
    "description": "There are now six majority-minority state senate districts in\nMassachusetts but only three give minority voters a robust chance of\nelecting their candidate of choice",
    "author": [
      {
        "name": "Brent Benson",
        "url": {}
      }
    ],
    "date": "2022-08-22",
    "categories": [],
    "contents": "\n\n\n\n\n\n\nOverview\nThis deep-dive on the 2020-2021 Massachusetts State Senate redistricting focuses on the Voting Rights Act’s requirement to create districts that disallow the dilution of minority voting blocks. By looking at the predominant voting group in each Massachusetts precinct we see the opportunity and limits of what can be achieved in for Massachusetts State Senate districts.\nWhile there are six state senate districts that are technically majority-minority in the newly created districts, only three provide a particular minority voting block with the power to elect its candidate of choice, and that is the best that can be done given Massachusetts voter demographics.\nRedistricting Concepts\nThe Massachusetts State Senate lines have been redrawn by the legislature after the 2020 Census as required by the constitution. For a guide to the redistricting principles used by the state legislatures, a good reference is the Executive Summary of the Redistricting Red Book, published by the National Conference of State Legislatures.\nThe primary responsibility given to redistricters by the constitution is to ensure equally-sized districts. For state legislatures, the courts have generally approved of redistricting plans where the largest and smallest districts are within 5 percent of the target population. The equal-size mandate results in the shifting of district lines as populations ebb and flow through the Commonwealth.\nThe next mandate for the redistricters comes from the Voting Rights Act (VRA) and relates to race, color, and minority language groups. While it is illegal to use race and ethnicity as factor in redistricting in the general case, it is also illegal to dilute concentrations of a minority voting block, resulting in that voting block not being able to elect its candidate of choice.\nWhile the short-hand concept of a majority-minority district is often used when evaluating redistricting plans, it is usually an oversimplification which does not addequately address minority voting block dilution. In particular, minority groups do not usually vote as a monolith. A district with 25% black voters and 30% hispanic voters is technically majority-minority, but gives neither the black voters nor the hispanic voters the ability to elect their preferred candidate. (In practice, redistricting bodies can use techniques like ecological regression to analyze and account for historical voting patterns and tendencies to understand the voting blocks in play.)\nThe newly drawn 2020-2021 Massachusetts State Senate districts increase the number of majority-minority districts from three to six, but only three of the districts contain a minority voting block with enough power to elect their candidate of choice. It is also clear from looking at the data that there aren’t enough geographically concentrated minority blocks in Massachusetts to do any better at this time.\nConcentrations of Minority Voting Blocks\nLet’s first look at the 2,152 voting precincts in Massachusetts by flagging any precinct that has a citizen voting age population (CVAP) for a minority group that is over 40% of the total citizen voting age population.\nWe use citizen voting age population because that is the actual number of people who are eligible to vote, a better determinant of voting power than total population. We will also use voting age population and overall population numbers when looking at specific districts, but CVAP makes sense as the number to consider for voting fairness.\n\n\nTable 1: Predominant voting group by voting precinct\n\n\nPredominant Group\n\n\nPrecinct Count\n\n\nPercent\n\n\nWhite\n\n\n1948\n\n\n91%\n\n\nBlack\n\n\n102\n\n\n5%\n\n\nHispanic\n\n\n94\n\n\n4%\n\n\nAsian\n\n\n5\n\n\n0%\n\n\nBlack_and_Hispanic\n\n\n3\n\n\n0%\n\n\nIf we look at the municipality of the 203 voting precincts that have a critical mass of minority voters (102+94+5+3) it guides us towards which precincts might be grouped together into a single district to prevent dilution of that minority group’s voting power.\n\n\nTable 2: Number of plausibly minority precincts by city/town\n\n\nCity/Town\n\n\nPredominant Group\n\n\nPrecinct Count\n\n\nBoston\n\n\nBlack\n\n\n71\n\n\nSpringfield\n\n\nHispanic\n\n\n29\n\n\nLawrence\n\n\nHispanic\n\n\n24\n\n\nBrockton\n\n\nBlack\n\n\n18\n\n\nChelsea\n\n\nHispanic\n\n\n12\n\n\nHolyoke\n\n\nHispanic\n\n\n9\n\n\nRandolph\n\n\nBlack\n\n\n6\n\n\nSpringfield\n\n\nBlack\n\n\n5\n\n\nBoston\n\n\nHispanic\n\n\n4\n\n\nLowell\n\n\nAsian\n\n\n4\n\n\nLynn\n\n\nHispanic\n\n\n4\n\n\nWorcester\n\n\nHispanic\n\n\n4\n\n\nBoston\n\n\nBlack_and_Hispanic\n\n\n2\n\n\nNew Bedford\n\n\nHispanic\n\n\n2\n\n\nCambridge\n\n\nBlack\n\n\n1\n\n\nFramingham\n\n\nHispanic\n\n\n1\n\n\nHaverhill\n\n\nHispanic\n\n\n1\n\n\nLowell\n\n\nHispanic\n\n\n1\n\n\nMethuen\n\n\nHispanic\n\n\n1\n\n\nMilton\n\n\nBlack\n\n\n1\n\n\nQuincy\n\n\nAsian\n\n\n1\n\n\nRevere\n\n\nHispanic\n\n\n1\n\n\nSalem\n\n\nHispanic\n\n\n1\n\n\nSpringfield\n\n\nBlack_and_Hispanic\n\n\n1\n\n\nA statewide map of the precincts with concentrated minority representation shows the limited number and concentration of such districts.\n\n\n\nFigure 1: Predominant group for all MA precincts\n\n\n\nA closer look at four of the clusters around Springfield, Lawrence, Boston, and Brockton show the biggest concentration of minority voting blocks. All but the Brockton/Randolph cluster have enough concentration to plausibly elect a minority candidate of choice.\n\n\n\nFigure 2: Cities with large minority voting blocks\n\n\n\nDistricts with Minority Power\nThe new Hampden, First Essex, and Second Suffolk Districts contain a large enough percentage of a particular minority group to allow for election of a candidate of choice by that minority group.\n\n\n\nThe Hampden District\n\n\n\n\n\n\n\n\nTable 3: Hampden District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n168,062\n\n\n46%\n\n\n23%\n\n\n3%\n\n\n31%\n\n\n69%\n\n\nVoting Age Population\n\n\n127,167\n\n\n41%\n\n\n22%\n\n\n3%\n\n\n36%\n\n\n64%\n\n\nCitizen Voting Age Population\n\n\n117,532\n\n\n40%\n\n\n17%\n\n\n2%\n\n\n41%\n\n\n59%\n\n\nThe Hampden State Senate District contains 90 percent of Springfield’s precincts and 60 percent of Chicopee’s precincts. The district has about as many hispanic voters as non-hispanic white voters, giving that voting block a chance at electing their preferred candidate.\nThe pre-2021 version of the Hampden district had a similar characteristics. In 2020 Springfield City Councilor Alex Gomez defeated incumbent State Senator James Welch in the Democratic primary.\nA simple precinct-level ecological regression model that uses Gomez’s margin over Welch as the response variable and the CVAP hispanic percent and whether the voter is in Springfield as interacting explanatory variables ends up explaining 90 percent of the variation in the margin of the 2020 Hampden District Democratic primary vote. Hispanic voters were much more likely to vote for Gomez, especially those who lived in Springfield an knew of Gomez from the City Council.\nThe First Essex District\n\n\n\n\nFigure 3: First Essex District\n\n\n\n\n\nTable 4: First Essex District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n167,027\n\n\n59%\n\n\n11%\n\n\n3%\n\n\n32%\n\n\n68%\n\n\nVoting Age Population\n\n\n126,539\n\n\n56%\n\n\n10%\n\n\n3%\n\n\n36%\n\n\n64%\n\n\nCitizen Voting Age Population\n\n\n96,884\n\n\n47%\n\n\n3%\n\n\n3%\n\n\n47%\n\n\n53%\n\n\nThe First Essex District is the first successful attempt to create a majority hispanic Lawrence-based State Senate district by carving out largely hispanic precincts in Haverhill to add to Lawrence’s large hispanic population.\nThe district contains all of Lawrence, all of Methuen, and approximately 11 precincts of Haverhill (give or take a few census blocks). The new lines result in a voting age population that is 36% White, 56% Hispanic, 10% Black, and 3% Asian. There is an almost 10 point difference when looking at hispanic citizen voting age population, showing the large assimilation of immigrants, and somewhat limiting voting power.\nThe First Essex incumbent, Diana DiZoglio (D-Methuen), is running for Auditor, leaving an open race for a competitive field of candidates from Lawrence (Pavel Payano and Doris Rodriguez) and Methuen (Eunice Zeigler).\nThe Second Suffolk District\n\n\n\n\nFigure 4: Second Suffolk District\n\n\n\n\n\nTable 5: Second Suffolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n181,874\n\n\n26%\n\n\n51%\n\n\n8%\n\n\n20%\n\n\n80%\n\n\nVoting Age Population\n\n\n145,535\n\n\n24%\n\n\n48%\n\n\n8%\n\n\n23%\n\n\n77%\n\n\nCitizen Voting Age Population\n\n\n124,934\n\n\n22%\n\n\n47%\n\n\n4%\n\n\n26%\n\n\n74%\n\n\nThe State Senate redistricting challenge in Boston is to create a district that gives candidate-of-choice power to black voters in Boston, whose numbers are large, but not large enough to give voting majorities in two districts. The 2020-2021 Senate redistricters shifted majority-black precincts from the First Suffolk District to the Second Suffolk, give a black citizen age voting population of 47%.\nThere is a very competitive 2022 Democratic primary for the Second Suffolk District featuring Miniard Culpepper, Nika Elugardo, Liz Miranda, and Dianne Wilkerson.\nThe remaining majority minority districts\nWhile there are three more majority-minority State Senate districts, none of contain a large enough block of minority voters to provide candidate of choice power to any one minority group.\nThe Second Plymouth and Norfolk District\n\n\n\n\nFigure 5: Second Plymouth and Norfolk District\n\n\n\n\n\nTable 6: Second Plymouth and Norfolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n172,727\n\n\n9%\n\n\n37%\n\n\n3%\n\n\n46%\n\n\n54%\n\n\nVoting Age Population\n\n\n133,529\n\n\n8%\n\n\n35%\n\n\n3%\n\n\n49%\n\n\n51%\n\n\nCitizen Voting Age Population\n\n\n112,378\n\n\n7%\n\n\n28%\n\n\n3%\n\n\n61%\n\n\n39%\n\n\nThe Second Plymouth and Norfolk District was a late-comer to the majority minority district additions during the latest redistricting process. The first draft of the senate redistricting plan left the Brockton-based district almost unchanged and grouped with the mostly white surrounding suburb of Hanover, Plympton and Easton. Pressure from redistricting advocacy groups led to a plan which extended the district through Avon into parts of Randolph that moved the demographics of the district into majority minority, while moving the white suburbs into adjacent districts.\nThe newly configured district has attracted an experienced Democratic challenger in Randolph Town Councilor Katrina Huff-Larmond who could increase the number of black women in the senate above one, Lydia Edward (D-Boston), if she were to win the primary on September 16th.\nThe First Suffolk District\n\n\n\n\n\nTable 7: First Suffolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n184,255\n\n\n13%\n\n\n25%\n\n\n16%\n\n\n46%\n\n\n54%\n\n\nVoting Age Population\n\n\n156,555\n\n\n12%\n\n\n23%\n\n\n15%\n\n\n50%\n\n\n50%\n\n\nCitizen Voting Age Population\n\n\n132,814\n\n\n11%\n\n\n23%\n\n\n11%\n\n\n55%\n\n\n45%\n\n\nThe First Suffolk District is currently represented by Nick Collins of South Boston. While the seat was held by Linda Dorcena Forry of Dorchester from 2013 through 2018, the demographics of the district are not particularly favorable for electing a black state senator. The 2020-2021 senate redistricting committe chose to shore up the Second Suffolk District to give its black voters the ability to elect their candidate of choice, leaving the First Suffolk with a black citizen voting age population of around 23%.\nThe Middlesex and Suffolk District\n\n\n\n\nFigure 6: Middlesex and Suffolk District\n\n\n\n\n\nTable 8: Middlesex and Suffolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n184,151\n\n\n27%\n\n\n13%\n\n\n14%\n\n\n42%\n\n\n58%\n\n\nVoting Age Population\n\n\n152,696\n\n\n24%\n\n\n12%\n\n\n15%\n\n\n46%\n\n\n54%\n\n\nCitizen Voting Age Population\n\n\n110,477\n\n\n17%\n\n\n12%\n\n\n10%\n\n\n61%\n\n\n39%\n\n\nThe Middelsex and Suffolk state senate district represented by Sal DiDomenico (D-Everett) has been redrawn adding sections of Cambridgeport and East Cambridge, while removing parts of Boston’s West End, Allston, and Brighton neighborhoods. While the overall population is 58% minority, the citizen voting age population is 39% minority and the largest minority voting block are hispanics at 17%.\nConclusion\nThe Massachusetts State Senate redistricting committee adhered to the letter and the spirit of the Voting Rights Act by doing its best to group together minority voting blocks and create districts with true minority voting power.\n\n\n\n",
    "preview": "posts/2022-07-18-senate-majority-minority/senate-majority-minority_files/figure-html5/vtd-minority-map-1.png",
    "last_modified": "2022-08-22T07:33:04-04:00",
    "input_file": "senate-majority-minority.knit.md",
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Mass. Numbers",
    "description": "Welcome to the Mass. Numbers blog. Mass. Numbers takes\na quantiative look as Massachusetts politics and policy.",
    "author": [
      {
        "name": "Brent Benson",
        "url": "https://massnumbers.us/brentbenson"
      }
    ],
    "date": "2022-08-21",
    "categories": [],
    "contents": "\n\n\n\n\n\n\nWelcome\nThe Mass. Numbers blog began in November of 2012 with a post comparing Elizabeth Warren’s win over Scott Brown to Martha Coakley’s 2010 loss, observing that Warren’s largest gains came in working class cities like Holyoke, Lawrence, Chelsea, and Brockton.\nSome of the things that enabled posts like these were easily accessible fine-grained election results and a nice tool for creating interactive maps: Google Fusion Tables. As you might have seen by clicking on the first post, Google stopped supporting Google Fusion Tables in 2019.\nThis new version of the Mass. Numbers blog is enabled by some other new tools. The technologies of Rmarkdown, Distill, and GitHub Pages allow for creating data-driven blog posts that can be compiled into nice looking web pages, but also allow for including all of the data and analysis that appear in the post. This is exciting because it reduces the number of steps between analysis and publishing a result, but also because it promotes transparency, open data journalism, and reproducible data science.\nIf you read a post on this blog and are curious about how the analysis was done, you can look at the linked GitHub repository and see the .Rmd source of the post and the referenced data, checked in and versioned in the repository.\nOne other shout-out goes to the tmap mapping library that does Google Fusion Tables one better by making it easy to create data driven maps, both static maps and interactive maps, with a simple configuration option. The fact that I can create the maps completely with code allows for a great deal of automation, reducing the amount of manual work to create a map, and resulting in something that is documented and reproducible.\nI am guessing that most readers of this blog are interested in the political analysis and data visualizations, but I felt that it made sense to explain the evolution of the technology behind this writing and to help others who are interested in reproducing the results, or want to take the analysis in another direction.\nI am interested in your feedback. You can send me feedback through my @bwbensonjr twitter, or using the email address with username brent and the domain of this website.\n\n\n\n",
    "preview": "posts/welcome/welcome_files/figure-html5/city-town-map-1.png",
    "last_modified": "2022-08-21T19:31:26-04:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
