[
  {
    "path": "posts/2022-07-05-state-senate-primary-preview/",
    "title": "An overview of the 2022 State Senate Primaries",
    "description": "A look at the ten contested MA State Senate primaries",
    "author": [
      {
        "name": "Brent Benson",
        "url": "https://twitter.com/bwbensonjr"
      }
    ],
    "date": "2022-08-25",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n\n\nFigure 1: MA State Senate Districts (2022)\n\n\n\nState Senate Primary Overview\nThere are ten State Senate districts with contested primaries. There are three Democratic incumbents with primary challengers—Joan Lovely (D-Salem), Walter Timility (D-Milton), Michael Brady (D-Brockton)—and one Republican with a primary challenge, Patrick O’Connor (R-Weymouth).\nThere are five open seats. Four of the open seats have a Democratic primary only, and one seat—Hampden, Hampshire and Worcester—has both a Democratic and Republican primary.\n\n\nTable 1: 2022 State Senate districts (last incumbent)*\n\n\nDistrict\n\n\nPVI\n\n\nInc. Pary\n\n\nIncumbent\n\n\nprimaries\n\n\nBerkshire, Hampden, Franklin and Hampshire\n\n\nD+18\n\n\nNone\n\n\n(Adam Hinds—Pittsfield)*\n\n\nD\n\n\nHampden and Hampshire\n\n\nD+6\n\n\nDem\n\n\nJohn C. Velis—Westfield\n\n\n\n\nHampden\n\n\nD+22\n\n\nDem\n\n\nAdam Gomez—Springfield\n\n\n\n\nHampden, Hampshire and Worcester\n\n\nD+4\n\n\nNone\n\n\n(Eric Lesser—Longmeadow)*\n\n\nD,R\n\n\nHampshire, Franklin and Worcester\n\n\nD+23\n\n\nDem\n\n\nJo Comerford—Florence\n\n\n\n\nWorcester and Hampshire\n\n\nEVEN\n\n\nDem\n\n\nAnne M. Gobi—Spencer\n\n\n\n\nWorcester and Hampden\n\n\nR+2\n\n\nGOP\n\n\nRyan C. Fattman—Sutton\n\n\n\n\nSecond Worcester\n\n\nD+11\n\n\nDem\n\n\nMichael O. Moore—Millbury\n\n\n\n\nFirst Worcester\n\n\nD+17\n\n\nNone\n\n\n(Harriette L. Chandler—Worcester)*\n\n\nD\n\n\nWorcester and Middlesex\n\n\nD+8\n\n\nDem\n\n\nJohn C. Cronin—Lunenburg\n\n\n\n\nFirst Middlesex\n\n\nD+8\n\n\nDem\n\n\nEdward J. Kennedy Jr.—Lowell\n\n\n\n\nMiddlesex and Worcester\n\n\nD+20\n\n\nDem\n\n\nJames B. Eldridge—Acton\n\n\n\n\nMiddlesex and Norfolk\n\n\nD+20\n\n\nDem\n\n\nKaren E. Spilka—Ashland\n\n\n\n\nNorfolk, Worcester and Middlesex\n\n\nD+12\n\n\nDem\n\n\nRebecca L. Rausch—Needham\n\n\n\n\nThird Middlesex\n\n\nD+20\n\n\nDem\n\n\nMichael J. Barrett—Lexington\n\n\n\n\nFourth Middlesex\n\n\nD+16\n\n\nDem\n\n\nCindy F. Friedman—Arlington\n\n\n\n\nNorfolk and Middlesex\n\n\nD+32\n\n\nDem\n\n\nCynthia Stone Creem—Newton\n\n\n\n\nNorfolk and Suffolk\n\n\nD+18\n\n\nDem\n\n\nMichael F. Rush—West Roxbury\n\n\n\n\nFirst Essex\n\n\nD+15\n\n\nNone\n\n\n(Diana DiZoglio—Methuen)*\n\n\nD\n\n\nSecond Essex and Middlesex\n\n\nD+6\n\n\nDem\n\n\nBarry R. Finegold—Andover\n\n\n\n\nFirst Essex and Middlesex\n\n\nD+10\n\n\nGOP\n\n\nBruce E. Tarr—Gloucester\n\n\n\n\nSecond Essex\n\n\nD+12\n\n\nDem\n\n\nJoan B. Lovely—Salem\n\n\nD\n\n\nFifth Middlesex\n\n\nD+16\n\n\nDem\n\n\nJason M. Lewis—Winchester\n\n\n\n\nThird Essex\n\n\nD+13\n\n\nDem\n\n\nBrendan P. Crighton—Lynn\n\n\n\n\nThird Suffolk\n\n\nD+21\n\n\nDem\n\n\nLydia Marie Edwards—Boston\n\n\n\n\nMiddlesex and Suffolk\n\n\nD+32\n\n\nDem\n\n\nSal N. DiDomenico—Everett\n\n\n\n\nSecond Middlesex\n\n\nD+32\n\n\nDem\n\n\nPatricia D. Jehlen—Somerville\n\n\n\n\nSuffolk and Middlesex\n\n\nD+32\n\n\nDem\n\n\nWilliam N. Brownsberger—Belmont\n\n\n\n\nSecond Suffolk\n\n\nD+42\n\n\nNone\n\n\n(Sonia Chang-Diaz—Boston)*\n\n\nD\n\n\nFirst Suffolk\n\n\nD+30\n\n\nDem\n\n\nNicholas P. Collins—South Boston\n\n\n\n\nFirst Plymouth and Norfolk\n\n\nD+9\n\n\nGOP\n\n\nPatrick O’Connor—Weymouth\n\n\nR\n\n\nNorfolk and Plymouth\n\n\nD+9\n\n\nDem\n\n\nJohn F. Keenan—Quincy\n\n\n\n\nNorfolk, Plymouth and Bristol\n\n\nD+11\n\n\nDem\n\n\nWalter F. Timilty—Milton\n\n\nD\n\n\nSecond Plymouth and Norfolk\n\n\nD+14\n\n\nDem\n\n\nMichael D. Brady—Brockton\n\n\nD\n\n\nBristol and Norfolk\n\n\nD+8\n\n\nDem\n\n\nPaul R. Feeney—Foxborough\n\n\n\n\nThird Bristol and Plymouth\n\n\nR+1\n\n\nDem\n\n\nMarc R. Pacheco—Taunton\n\n\n\n\nFirst Bristol and Plymouth\n\n\nD+1\n\n\nDem\n\n\nMichael J. Rodrigues—Westport\n\n\n\n\nSecond Bristol and Plymouth\n\n\nD+7\n\n\nDem\n\n\nMark C. Montigny—New Bedford\n\n\n\n\nPlymouth and Barnstable\n\n\nD+4\n\n\nDem\n\n\nSusan Lynn Moran—Falmouth\n\n\n\n\nCape and Islands\n\n\nD+12\n\n\nDem\n\n\nJulian A. Cyr—Truro\n\n\nR\n\n\nDistrict/Primary Breakdowns\nIn the following sections focusing on each district/primary race, the map shows a measure of partisanship (PVI) of each town (or precinct in districts where cities or towns are split), overlaps of any incumbent districts, and a small dot indicating the home region of each candidate.\nBerkshire, Hampden, Franklin and Hampshire\n\n\n\n\n\n\n\nFigure 2: Berkshire, Hampden, Franklin and Hampshire\n\n\n\n\n\nTable 2: Berkshire, Hampden, Franklin and Hampshire candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nN\n\n\nPaul W. Mark\n\n\nD\n\n\nBecket\n\n\n$48,446\n\n\n$38,288\n\n\n$100,345\n\n\nN\n\n\nHuff Tyler Templeton, III\n\n\nD\n\n\nWilliamstown\n\n\n$4,040\n\n\n$64\n\n\n$3,976\n\n\nN\n\n\nBrendan M. Phair\n\n\nU\n\n\nPittsfield\n\n\n$2,155\n\n\n$1,738\n\n\n$628\n\n\nThe newly created and enormous Berkshire, Hampden, Franklin and Hampshire district contains 57 cities and towns in Western Massachusetts. The incumbent of the existing and similarly named Berkshire, Hampshire, Franklin and Hampden district, Adam Hinds (D-Pittsfield) ran an unsuccessful campaign for Lieutenant Governor, leaving this district without an incumbent senator.\nThe Democratic primary will feature sitting State Representative Paul Mark (D-Becket) whose current Second Berkshire State Representative district is outlined in the map, and Williamstown former small business owner and local municipal board member Huff Templeton III. Representative Mark will have an advantage as about 20% of the Senate district’s Democratic primary voters will have seen him on the ballot (using an average of vote totals from previous elections), and likely will have voted for him in the past.\nThe D+18 Partisan Voter Index (PVI) will make the winner of the Democratic primary the prohibitive favorite in November’s general election against unenrolled candidate Brendan Phair of Pittsfield.\nHampden, Hampshire and Worcester\n\n\n\n\n\n\n\nFigure 3: Hampden, Hampshire and Worcesterm\n\n\n\n\n\nTable 3: Hampden, Hampshire and Worcester candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nN\n\n\nSydney R. Levin-Epstein\n\n\nD\n\n\nLongmeadow\n\n\n$90,336\n\n\n$18,616\n\n\n$71,720\n\n\nN\n\n\nJacob R. Oliveira\n\n\nD\n\n\nLudlow\n\n\n$52,999\n\n\n$27,565\n\n\n$41,186\n\n\nN\n\n\nJohn Harding\n\n\nR\n\n\nEast Longmeadow\n\n\n$2,775\n\n\n$2,775\n\n\n$0\n\n\nN\n\n\nWilliam E. Johnson\n\n\nR\n\n\nGranby\n\n\n$73,627\n\n\n$18,980\n\n\n$55,180\n\n\nThe new Hampden, Hampshire and Worcester district is closely related to the previous First Hampden and Hampshire district currently held by Eric Lesser (D-Longmeadow) who is running for Lieutenant Governor. It is the only state senate seat to feature both a Democratic and Republican primary in 2022.\nOn the Democratic side, first term State Representative Jacob Oliveira (D-Ludlow) faces campaign strategist Sydney Levin-Epstein of Longmeadow. The dashed line on map shows the overlap of the Oliveira-held Seventh Hampden State Rep district.\nOliveira comes off a hotly contested State Rep win where he defeated Republican James “Chip” Harrington by 134 votes after a recount. Perennial candidate Harrington is running for state rep again against Democrat Aaron Saunders of Belchertown.\nLevin-Epstein served as Deputy Finance Director for Ed Markey’s 2020 re-election campaign and is bringing her political organizing experience to bear on her own campaign this year.\nThe two GOP candidates are John Harding of East Longmeadow, a former military office, and William Johnson, a business owner from Granby.\nFirst Worcester\n\n\n\n\n\n\n\nFigure 4: Hampden, Hampshire and Worcesterm\n\n\n\n\n\nTable 4: First Worcester candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nN\n\n\nRobyn K. Kennedy\n\n\nD\n\n\nWorcester\n\n\n$67,238\n\n\n$41,717\n\n\n$25,521\n\n\nN\n\n\nJoseph M. Petty\n\n\nD\n\n\nWorcester\n\n\n$97,524\n\n\n$81,655\n\n\n$64,727\n\n\nN\n\n\nLisa K. Mair\n\n\nU\n\n\nBerlin\n\n\n$4,739\n\n\n$1,740\n\n\n$2,999\n\n\nSenator Harriet Chandler (D-Worcester) is retiring after a 31-year career in public service. There are two Democrats vying for the Democratic nomination in the First Worcester district, comprised of much of Worcester, Boylston, West Boylston, Northborough, Berlin, and Bolton.\nRobyn Kennedy of Worcester is the Executive Director or the YWCA of Central Massachusetts and has the backing of former Governor Deval Patrick and his Worcester-based Lt. Governor Tim Murray.\nJoseph Petty has been serving as the mayor of Worcester since 2012 and has gained the endorsement of Senator Ed Markey.\nDespite the Markey endorsement for Petty, Kennedy has been getting support from many of the more progressive groups. Petty has been running on his experience, presenting an establishment candidate message.\nPetty started with $48,859 in his mayoral campaign account when he changed its purpose to the State Senate seat in February, 2022, giving him a big head start over Kennedy who was starting from scratch. Kennedy has since raised approximately two thirds as much as Petty, spent about half, and had about 40% of Petty’s cash on hand as of the end of July.\nThe winner of the Democratic primary will face undeclared candidate Lisa Mair of Berlin who is running on a platform of informed medical consent and lower taxes. The Democrat will have a strong advantage in this D+17 district.\nFirst Essex\n\n\n\n\n\n\n\nFigure 5: First Essex Senate Districtm\n\n\n\n\n\nTable 5: First Essex candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nN\n\n\nPavel Payano\n\n\nD\n\n\nLawrence\n\n\n$58,892\n\n\n$32,622\n\n\n$44,228\n\n\nN\n\n\nDoris V. Rodriguez\n\n\nD\n\n\nLawrence\n\n\n$4,838\n\n\n$4,533\n\n\n$177\n\n\nN\n\n\nEunice Delice Zeigler\n\n\nD\n\n\nMethuen\n\n\n$50,347\n\n\n$25,303\n\n\n$35,060\n\n\nAs mentioned in ourredistricting post, the First Essex district is a new majority-Hispanic district containing all of Lawrence, all of Methuen, and some inner precincts of Haverhill. There is no incumbent senator running as Diana DiZoglio (D-Methuen) is running for auditor.\nPavel Payano is an at-large City Councilor in Lawrence; Doris Rodriguiez is a tax layer from Lawrence with public and private sector experience; and Eunice Zeigler is a City Councilor from Methuen. Payano and Zeigler have been able to raise and spend similar amounts of campaign funds.\nA look at the total number of votes from each of the cities in the precincts contained in the First Essex District show that over 50% of the votes come from Lawrence, while 26% come from Methuen, and 23% from Haverhill, giving the Lawrence candidates somewhat of an advantage.\n\n\nTable 6: First Essex vote distribution 2016/2020 presidential\n\n\ncity_town\n\n\nvotes\n\n\npercent\n\n\nHaverhill\n\n\n1,321,958\n\n\n23%\n\n\nLawrence\n\n\n2,884,272\n\n\n51%\n\n\nMethuen\n\n\n1,442,136\n\n\n26%\n\n\nSecond Essex\n\n\n\n\n\n\n\nFigure 6: Second Essex State Senate Districtm\n\n\n\n\n\nTable 7: Second Essex candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nY\n\n\nJoan B. Lovely\n\n\nD\n\n\nSalem\n\n\n$37,113\n\n\n$22,060\n\n\n$94,370\n\n\nN\n\n\nKyle Alexander Davis\n\n\nD\n\n\nDanvers\n\n\n$27,568\n\n\n$27,970\n\n\n$1,211\n\n\nN\n\n\nDamian M. Anketell\n\n\nR\n\n\nPeabody\n\n\n\n\n\n\n\n\nAssistant Majority Leader Joan Lovely (D-Salem) faces a primary challenge from Kyle Davis of Danvers. Davis has pursued a career as an artist and performer, supporting himself with day jobs as a waiter and food delivery driver, and is running in a attempt to diversify the legislature with people from atypical political backgrounds.\nSenator Lovely’s fundraising isn’t particularly strong for an incumbent State Senator, but challenger Davis’s numbers are weaker than they appear based on totals. The $27-28,000 raised and spent numbers seem reasonable until you look at the particulars. There was a mistaken transfer into the account of $15,000 (since transfered out) and a mistaken personal expense written as a check from the account for $2,483 (since returned), combined with candidate loans to the campaign of $2,400 and $1,500 which brings the actual amount raised from non-candidate sources to $6,185.\nThe winner for the Democratic primary will face Republican Damian Anketell who seems to have previously run for Essex County Sheriff as a Democrat. Anketell has been featured at Mass. GOP events promoted by Howie Carr to get a referendum question on the ballot to deny drivers licenses for undocumented immigrants. Anketell has made the extraordinary move of filling out Office of Campaign and Political Finance (OCPF) from CPF D104 which states that he will not raise or expend campaign funds in this race.\nThe D+12 district will likely go to the Democrat, regardless of primary outcome, but the incumbency advantage of Lovely would make it highly unlikely for a GOP pickup, especially with the promise of no money raised or spent by the GOP candidate.\nSecond Suffolk\n\n\n\n\n\n\n\nFigure 7: Second Suffolk State Senate Districtm\n\n\n\n\n\nTable 8: Second Suffolk candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nN\n\n\nMiniard Culpepper\n\n\nD\n\n\nBoston\n\n\n$157,273\n\n\n$45,935\n\n\n$111,338\n\n\nN\n\n\nNika Elugardo\n\n\nD\n\n\nJamaica Plain\n\n\n$102,324\n\n\n$111,936\n\n\n$10,545\n\n\nN\n\n\nJames E. Grant\n\n\nD\n\n\nBoston\n\n\n$217\n\n\n$0\n\n\n$216\n\n\nN\n\n\nLiz Miranda\n\n\nD\n\n\nBoston\n\n\n$172,074\n\n\n$188,753\n\n\n$13,935\n\n\nN\n\n\nDianne Wilkerson\n\n\nD\n\n\nRoxbury\n\n\n$11,375\n\n\n$9,546\n\n\n$1,830\n\n\nSenator Sonia Chang-Diaz (D-Boston) decided to run for Massachusetts Governor, rather than for re-election to the State Senate, leaving the true blue Second Suffolk District as an open seat. There are five candidates vying for the Democratic nomination, although James Grant does not seem to pursuing a strong campaign, raising money, or participating in debates. The primary winner will take office in January, given that no non-Democratic candidates qualified for the race, not to mention its status as the most Democratic Massachusetts state senate district with a whopping PVI of D+42.\nThere are two sitting State Representatives in the race for the Second Suffolk. Nika Elguardo (D-Jamaica Plain) represents the 15th Suffolk State Representative District (dotted outline in the map), and Liz Miranda (D-Boston) represents the 5th Suffolk State Representative District (dashed outline in the map). Neither of these state representative districts overlaps with Second Suffolk State Senate district to a large extent.\nMiniard Culpepper is a Baptist minister, lawyer, community activist, and former regional counsel for the Department of Housing and Urban Development (HUD).\nDiane Wilkerson is a former State Senator who plead guitly to extortion charges and spent two and a half years in prison. Wilkerson is attempting to make a political comeback, counting on voters to forgive the transgressions for which she has paid a steep price.\nCulpepper, Elugardo, and Miranda have all raised serious amounts of campaign money. Miranda wins the fundraising and spending titles so far, having raised $172,074 and spent $188,753. Elugardo has raised $102,324 and spent $111,936 this year. Culpepper raised more than Elugardo in the same period, $157,273, but has only spent $45,935. It is not quite to the point as of July 31 filing that having Culpepper’s $111,338 left in the bank is a liability, but the closer it gets to primary day, the less useful unspent dollars become.\nFirst Plymouth and Norfolk\n\n\n\n\n\n\n\nFigure 8: First Plymouth and Norfolk District\n\n\n\n\n\nTable 9: First Plymouth and Norfolk candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nN\n\n\n\n\nD\n\n\nHanson\n\n\n$0\n\n\n$0\n\n\n$0\n\n\nY\n\n\nPatrick Michael O’Connor\n\n\nR\n\n\nWeymouth\n\n\n$68,481\n\n\n$64,169\n\n\n$104,450\n\n\nN\n\n\nRonald J. Patuto\n\n\nR\n\n\nMarshfield\n\n\n$6,700\n\n\n$0\n\n\n$6,700\n\n\nSenator Patrick O’Connor (D-Weymouth) is the only incumbent GOP senator to face electoral opposition in 2022. O’Connor is widely considered a moderate Republican in the Massachusetts vein. He did vote against the final version of the MA ROE Act, citing issues of expanding third trimester abortions and removal of most parental consent, but is a proponent of clean energy and universal full-day kindergarten.\nSenator O’Connor faces Marshfield Republican Ronald Patuto in the GOP primary. There isn’t a great deal of campaign information about Patuto on the internet, but a radio forum on WATD has Patuto arguing for less regulation of the lobstering business where he gets his livelihood, and against public school mask mandates.\nWhile I am not publishing model-based predictions for the primaries, this race is one where the general election model shows a big difference between the probability of a GOP general election win if O’Connor, the incumbent wins the primary (93% likelihood of GOP win), and if Patuto, the challenger wins the primary (21% likelihood of GOP win). This contrast demonstrates the power of incumbency and the fact that this moderate-for-MA state senate district (it is the 13th most Republican-leaning State Senate District) has as a Partisan Voter Index (PVI) of D+9, making it an easy-enough Democratic target without a moderate incumbent Republican on the ballot.\nHowever, the Democratic candidate for the First Plymouth and Norfolk District, Robert Stephens Jr. Hanson, is nowhere to be found on the internet and has not raised any campaign funds as of July 31.\nNorfolk, Plymouth and Bristol\n\n\n\n\n\n\n\nFigure 9: Norfolk, Plymouth and Bristol District\n\n\n\n\n\nTable 10: Norfolk, Plymouth and Bristol candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nY\n\n\nWalter F. Timilty\n\n\nD\n\n\nMilton\n\n\n$50,677\n\n\n$66,894\n\n\n$45,785\n\n\nN\n\n\nKathleen Crogan-Camara\n\n\nD\n\n\nRandolph\n\n\n$43,661\n\n\n$31,686\n\n\n$11,975\n\n\nN\n\n\nBrian R. Muello\n\n\nR\n\n\nBraintree\n\n\n$1,000\n\n\n$0\n\n\n$1,000\n\n\nState Senator Walter Timilty (D-Milton) is considered on the conservative side of the Massachusetts Democratic Party. One recent example would be his “No” vote on the MA ROE Act to expand and codify the right to an abortion in Massachusetts.\nTimilty’s challenger for the Democratic nomination is Kathleen Crogan-Camara who is running on a platform promoting disability rights, but is also challenging Timilty with a much more progressive view on issues like women’s reproductive rights, LGBTQ+ rights, and immigrant rights. Crogan-Camara has gotten the endorsement of the Planned Parenthood Action Fund and has raised enough money to run a creditable campaign.\nThe winner of the Democratic primary will face another perennial candidate, Republican Brian Muello of Braintree who has run unsuccessfully for Mayor of Braintree, Braintree selectman, Braintree Town Clerk, and U.S. Senate.\nSecond Plymouth and Norfolk\n\n\n\n\n\n\n\nFigure 10: Second Plymouth and Norfolk\n\n\n\n\n\nTable 11: Second Plymouth and Norfolk candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nY\n\n\nMichael D. Brady\n\n\nD\n\n\nBrockton\n\n\n$45,741\n\n\n$22,693\n\n\n$47,231\n\n\nN\n\n\nKatrina M. Huff-Larmond\n\n\nD\n\n\nRandolph\n\n\n$17,314\n\n\n$15,355\n\n\n$1,959\n\n\nN\n\n\nJim Gordon\n\n\nR\n\n\nHanson\n\n\n$7,548\n\n\n$5,775\n\n\n$1,773\n\n\nAnother incumbent State Senator facing both a Democratic primary and a Republican general election challenger is Michael Brady (D-Brockton). As mentioned in our redistricting post, the Second Plymouth and Norfolk district is also newly minted majority minority district with 49% White, 35% Black, 8% Hispanic, and 3% Asian in terms of voting age population. However, the black citizen voting age population is only 28% of the electorate, making this a difficult district for a black voting block to elect its candidate of choice.\nSenator Brady has weathered some challenges over the past several years, having been arrested for drunk driving in 2018 and being stripped of his committee chairmanship. Brady has since been re-instated to his leadership positions, presumably after serving out his probation with a dismissal of charges as per agreement.\nChallenger Katrina Huff-Larmond, a Randolph Town Councilor, is campaigning on change, leadership, a deeper connection with the people. In addition, Huff-Larmond participated in the redistricting process and created a more diverse senate district in the process. Huff-Larmond has raised $17,314 for the race so far, not insignificant, but still at a disadvantage to Brady’s larger and longer-term campaign funds.\nThe winner of the Democratic primary will face Republican Jim Gordon of Hanson who is running on a platform for parental review of educational material, restoring qualified immunity for law enforcement, and cutting taxes while increasing infrastructure spending. The simple model I use for estimating general election results based on PVI, incumbency, and whether it is a presidential voting year gives Gordon a 2 out of 100 chance of winning against Brady and a 1 out of 10 chance at beating Huff-Larmond.\nCape and Islands\n\n\n\n\n\n\n\nFigure 11: Second Plymouth and Norfolk\n\n\n\n\n\nTable 12: Cape and Islands candidates (year-to-date $)\n\n\nInc\n\n\nCandidate\n\n\nParty\n\n\ncity_town\n\n\nreceipts\n\n\nspent\n\n\ncash\n\n\nY\n\n\nJulian Andre Cyr\n\n\nD\n\n\nTruro\n\n\n$105,481\n\n\n$54,105\n\n\n$290,804\n\n\nN\n\n\nDaralyn Andrea Heywood\n\n\nR\n\n\nWest Barnstable\n\n\n$17,140\n\n\n$9,066\n\n\n$8,074\n\n\nN\n\n\nChristopher Robert Lauzon\n\n\nR\n\n\nMills Village\n\n\n$12,106\n\n\n$9,664\n\n\n$2,443\n\n\nState Senator Julian Cyr is free from Democratic primary challengers in 2022, but will face the winner of a two-way Republican primary in November. It is quite unlikely that the Republican nominee will unseat incumbent Cyr in the D+12 Cape and Islands District.\nDaralyn Heywood is a private investigator and former State Police lieutenant running on a anti-illegal immigrant and pro-America platform.\nChristopher Lauzon is a former cruise deck-hand who now works in a family-owned auto repair business in Hyanis. Lauzon is running on a platform of lowering taxes, reducing regulation, and supporting and defending law enforcement.\nBoth GOP candidates have raised at the lower end of the spectrum for credible state senate challenger campaign funds, and are nowhere close to Senator Cyr’s ability to raise, spend, and save campaign cash.\n\n\n\n",
    "preview": "https://www.massnumbers.us/images/berk_hamp_frank_hamp.png",
    "last_modified": "2022-08-25T16:58:27-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-07-18-senate-majority-minority/",
    "title": "A look at MA State Senate Redistricting",
    "description": "There are now six majority-minority state senate districts in\nMassachusetts but only three give minority voters a robust chance of\nelecting their candidate of choice",
    "author": [
      {
        "name": "Brent Benson",
        "url": {}
      }
    ],
    "date": "2022-08-22",
    "categories": [],
    "contents": "\n\n\n\n\n\n\nOverview\nThis deep-dive on the 2020-2021 Massachusetts State Senate redistricting focuses on the Voting Rights Act’s requirement to create districts that disallow the dilution of minority voting blocks. By looking at the predominant voting group in each Massachusetts precinct we see the opportunity and limits of what can be achieved in for Massachusetts State Senate districts.\nWhile there are six state senate districts that are technically majority-minority in the newly created districts, only three provide a particular minority voting block with the power to elect its candidate of choice, and that is the best that can be done given Massachusetts voter demographics.\nRedistricting Concepts\nThe Massachusetts State Senate lines have been redrawn by the legislature after the 2020 Census as required by the constitution. For a guide to the redistricting principles used by the state legislatures, a good reference is the Executive Summary of the Redistricting Red Book, published by the National Conference of State Legislatures.\nThe primary responsibility given to redistricters by the constitution is to ensure equally-sized districts. For state legislatures, the courts have generally approved of redistricting plans where the largest and smallest districts are within 5 percent of the target population. The equal-size mandate results in the shifting of district lines as populations ebb and flow through the Commonwealth.\nThe next mandate for the redistricters comes from the Voting Rights Act (VRA) and relates to race, color, and minority language groups. While it is illegal to use race and ethnicity as factor in redistricting in the general case, it is also illegal to dilute concentrations of a minority voting block, resulting in that voting block not being able to elect its candidate of choice.\nWhile the short-hand concept of a majority-minority district is often used when evaluating redistricting plans, it is usually an oversimplification which does not addequately address minority voting block dilution. In particular, minority groups do not usually vote as a monolith. A district with 25% black voters and 30% hispanic voters is technically majority-minority, but gives neither the black voters nor the hispanic voters the ability to elect their preferred candidate. (In practice, redistricting bodies can use techniques like ecological regression to analyze and account for historical voting patterns and tendencies to understand the voting blocks in play.)\nThe newly drawn 2020-2021 Massachusetts State Senate districts increase the number of majority-minority districts from three to six, but only three of the districts contain a minority voting block with enough power to elect their candidate of choice. It is also clear from looking at the data that there aren’t enough geographically concentrated minority blocks in Massachusetts to do any better at this time.\nConcentrations of Minority Voting Blocks\nLet’s first look at the 2,152 voting precincts in Massachusetts by flagging any precinct that has a citizen voting age population (CVAP) for a minority group that is over 40% of the total citizen voting age population.\nWe use citizen voting age population because that is the actual number of people who are eligible to vote, a better determinant of voting power than total population. We will also use voting age population and overall population numbers when looking at specific districts, but CVAP makes sense as the number to consider for voting fairness.\n\n\nTable 1: Predominant voting group by voting precinct\n\n\nPredominant Group\n\n\nPrecinct Count\n\n\nPercent\n\n\nWhite\n\n\n1948\n\n\n91%\n\n\nBlack\n\n\n102\n\n\n5%\n\n\nHispanic\n\n\n94\n\n\n4%\n\n\nAsian\n\n\n5\n\n\n0%\n\n\nBlack_and_Hispanic\n\n\n3\n\n\n0%\n\n\nIf we look at the municipality of the 203 voting precincts that have a critical mass of minority voters (102+94+5+3) it guides us towards which precincts might be grouped together into a single district to prevent dilution of that minority group’s voting power.\n\n\nTable 2: Number of plausibly minority precincts by city/town\n\n\nCity/Town\n\n\nPredominant Group\n\n\nPrecinct Count\n\n\nBoston\n\n\nBlack\n\n\n71\n\n\nSpringfield\n\n\nHispanic\n\n\n29\n\n\nLawrence\n\n\nHispanic\n\n\n24\n\n\nBrockton\n\n\nBlack\n\n\n18\n\n\nChelsea\n\n\nHispanic\n\n\n12\n\n\nHolyoke\n\n\nHispanic\n\n\n9\n\n\nRandolph\n\n\nBlack\n\n\n6\n\n\nSpringfield\n\n\nBlack\n\n\n5\n\n\nBoston\n\n\nHispanic\n\n\n4\n\n\nLowell\n\n\nAsian\n\n\n4\n\n\nLynn\n\n\nHispanic\n\n\n4\n\n\nWorcester\n\n\nHispanic\n\n\n4\n\n\nBoston\n\n\nBlack_and_Hispanic\n\n\n2\n\n\nNew Bedford\n\n\nHispanic\n\n\n2\n\n\nCambridge\n\n\nBlack\n\n\n1\n\n\nFramingham\n\n\nHispanic\n\n\n1\n\n\nHaverhill\n\n\nHispanic\n\n\n1\n\n\nLowell\n\n\nHispanic\n\n\n1\n\n\nMethuen\n\n\nHispanic\n\n\n1\n\n\nMilton\n\n\nBlack\n\n\n1\n\n\nQuincy\n\n\nAsian\n\n\n1\n\n\nRevere\n\n\nHispanic\n\n\n1\n\n\nSalem\n\n\nHispanic\n\n\n1\n\n\nSpringfield\n\n\nBlack_and_Hispanic\n\n\n1\n\n\nA statewide map of the precincts with concentrated minority representation shows the limited number and concentration of such districts.\n\n\n\nFigure 1: Predominant group for all MA precincts\n\n\n\nA closer look at four of the clusters around Springfield, Lawrence, Boston, and Brockton show the biggest concentration of minority voting blocks. All but the Brockton/Randolph cluster have enough concentration to plausibly elect a minority candidate of choice.\n\n\n\nFigure 2: Cities with large minority voting blocks\n\n\n\nDistricts with Minority Power\nThe new Hampden, First Essex, and Second Suffolk Districts contain a large enough percentage of a particular minority group to allow for election of a candidate of choice by that minority group.\n\n\n\nThe Hampden District\n\n\n\n\n\n\n\n\nTable 3: Hampden District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n168,062\n\n\n46%\n\n\n23%\n\n\n3%\n\n\n31%\n\n\n69%\n\n\nVoting Age Population\n\n\n127,167\n\n\n41%\n\n\n22%\n\n\n3%\n\n\n36%\n\n\n64%\n\n\nCitizen Voting Age Population\n\n\n117,532\n\n\n40%\n\n\n17%\n\n\n2%\n\n\n41%\n\n\n59%\n\n\nThe Hampden State Senate District contains 90 percent of Springfield’s precincts and 60 percent of Chicopee’s precincts. The district has about as many hispanic voters as non-hispanic white voters, giving that voting block a chance at electing their preferred candidate.\nThe pre-2021 version of the Hampden district had a similar characteristics. In 2020 Springfield City Councilor Alex Gomez defeated incumbent State Senator James Welch in the Democratic primary.\nA simple precinct-level ecological regression model that uses Gomez’s margin over Welch as the response variable and the CVAP hispanic percent and whether the voter is in Springfield as interacting explanatory variables ends up explaining 90 percent of the variation in the margin of the 2020 Hampden District Democratic primary vote. Hispanic voters were much more likely to vote for Gomez, especially those who lived in Springfield and might be familiar with Gomez from the City Council.\nThe First Essex District\n\n\n\n\nFigure 3: First Essex District\n\n\n\n\n\nTable 4: First Essex District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n167,027\n\n\n59%\n\n\n11%\n\n\n3%\n\n\n32%\n\n\n68%\n\n\nVoting Age Population\n\n\n126,539\n\n\n56%\n\n\n10%\n\n\n3%\n\n\n36%\n\n\n64%\n\n\nCitizen Voting Age Population\n\n\n96,884\n\n\n47%\n\n\n3%\n\n\n3%\n\n\n47%\n\n\n53%\n\n\nThe First Essex District is the first successful attempt to create a majority hispanic Lawrence-based State Senate district by carving out largely hispanic precincts in Haverhill to add to Lawrence’s large hispanic population.\nThe district contains all of Lawrence, all of Methuen, and approximately 11 precincts of Haverhill (give or take a few census blocks). The new lines result in a voting age population that is 36% White, 56% Hispanic, 10% Black, and 3% Asian. There is an almost 10 point difference when looking at hispanic citizen voting age population, showing the large assimilation of immigrants, and somewhat limiting voting power.\nThe First Essex incumbent, Diana DiZoglio (D-Methuen), is running for Auditor, leaving an open race for a competitive field of candidates from Lawrence (Pavel Payano and Doris Rodriguez) and Methuen (Eunice Zeigler).\nThe Second Suffolk District\n\n\n\n\nFigure 4: Second Suffolk District\n\n\n\n\n\nTable 5: Second Suffolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n181,874\n\n\n26%\n\n\n51%\n\n\n8%\n\n\n20%\n\n\n80%\n\n\nVoting Age Population\n\n\n145,535\n\n\n24%\n\n\n48%\n\n\n8%\n\n\n23%\n\n\n77%\n\n\nCitizen Voting Age Population\n\n\n124,934\n\n\n22%\n\n\n47%\n\n\n4%\n\n\n26%\n\n\n74%\n\n\nThe State Senate redistricting challenge in Boston is to create a district that gives candidate-of-choice power to black voters in Boston, whose numbers are large, but not large enough to give voting majorities in two districts. The 2020-2021 Senate redistricters shifted majority-black precincts from the First Suffolk District to the Second Suffolk, give a black citizen age voting population of 47%.\nThere is a very competitive 2022 Democratic primary for the Second Suffolk District featuring Miniard Culpepper, Nika Elugardo, Liz Miranda, and Dianne Wilkerson.\nThe remaining majority minority districts\nWhile there are three more majority-minority State Senate districts, none of contain a large enough block of minority voters to provide candidate of choice power to any one minority group.\nThe Second Plymouth and Norfolk District\n\n\n\n\nFigure 5: Second Plymouth and Norfolk District\n\n\n\n\n\nTable 6: Second Plymouth and Norfolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n172,727\n\n\n9%\n\n\n37%\n\n\n3%\n\n\n46%\n\n\n54%\n\n\nVoting Age Population\n\n\n133,529\n\n\n8%\n\n\n35%\n\n\n3%\n\n\n49%\n\n\n51%\n\n\nCitizen Voting Age Population\n\n\n112,378\n\n\n7%\n\n\n28%\n\n\n3%\n\n\n61%\n\n\n39%\n\n\nThe Second Plymouth and Norfolk District was a late-comer to the majority minority district additions during the latest redistricting process. The first draft of the senate redistricting plan left the Brockton-based district almost unchanged and grouped with the mostly white surrounding suburb of Hanover, Plympton and Easton. Pressure from redistricting advocacy groups led to a plan which extended the district through Avon into parts of Randolph that moved the demographics of the district into majority minority, while moving the white suburbs into adjacent districts.\nThe newly configured district has attracted an experienced Democratic challenger in Randolph Town Councilor Katrina Huff-Larmond who could increase the number of black women in the senate above one, Lydia Edward (D-Boston), if she were to win the primary on September 16th.\nThe First Suffolk District\n\n\n\n\n\nTable 7: First Suffolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n184,255\n\n\n13%\n\n\n25%\n\n\n16%\n\n\n46%\n\n\n54%\n\n\nVoting Age Population\n\n\n156,555\n\n\n12%\n\n\n23%\n\n\n15%\n\n\n50%\n\n\n50%\n\n\nCitizen Voting Age Population\n\n\n132,814\n\n\n11%\n\n\n23%\n\n\n11%\n\n\n55%\n\n\n45%\n\n\nThe First Suffolk District is currently represented by Nick Collins of South Boston. While the seat was held by Linda Dorcena Forry of Dorchester from 2013 through 2018, the demographics of the district are not particularly favorable for electing a black state senator. The 2020-2021 senate redistricting committe chose to shore up the Second Suffolk District to give its black voters the ability to elect their candidate of choice, leaving the First Suffolk with a black citizen voting age population of around 23%.\nThe Middlesex and Suffolk District\n\n\n\n\nFigure 6: Middlesex and Suffolk District\n\n\n\n\n\nTable 8: Middlesex and Suffolk District Demographics\n\n\nstat\n\n\ntotal\n\n\nhispanic\n\n\nblack\n\n\nasian\n\n\nwhite\n\n\nminority\n\n\nTotal Population\n\n\n184,151\n\n\n27%\n\n\n13%\n\n\n14%\n\n\n42%\n\n\n58%\n\n\nVoting Age Population\n\n\n152,696\n\n\n24%\n\n\n12%\n\n\n15%\n\n\n46%\n\n\n54%\n\n\nCitizen Voting Age Population\n\n\n110,477\n\n\n17%\n\n\n12%\n\n\n10%\n\n\n61%\n\n\n39%\n\n\nThe Middelsex and Suffolk state senate district represented by Sal DiDomenico (D-Everett) has been redrawn adding sections of Cambridgeport and East Cambridge, while removing parts of Boston’s West End, Allston, and Brighton neighborhoods. While the overall population is 58% minority, the citizen voting age population is 39% minority and the largest minority voting block are hispanics at 17%.\nConclusion\nThe Massachusetts State Senate redistricting committee adhered to the letter and the spirit of the Voting Rights Act by doing its best to group together minority voting blocks and create districts with true minority voting power.\n\n\n\n",
    "preview": "posts/2022-07-18-senate-majority-minority/senate-majority-minority_files/figure-html5/vtd-minority-map-1.png",
    "last_modified": "2022-08-22T08:27:22-04:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Mass. Numbers",
    "description": "Welcome to the Mass. Numbers blog. Mass. Numbers takes\na quantiative look as Massachusetts politics and policy.",
    "author": [
      {
        "name": "Brent Benson",
        "url": "https://massnumbers.us/brentbenson"
      }
    ],
    "date": "2022-08-21",
    "categories": [],
    "contents": "\n\n\n\n\n\n\nWelcome\nThe Mass. Numbers blog began in November of 2012 with a post comparing Elizabeth Warren’s win over Scott Brown to Martha Coakley’s 2010 loss, observing that Warren’s largest gains came in working class cities like Holyoke, Lawrence, Chelsea, and Brockton.\nSome of the things that enabled posts like these were easily accessible fine-grained election results and a nice tool for creating interactive maps: Google Fusion Tables. As you might have seen by clicking on the first post, Google stopped supporting Google Fusion Tables in 2019.\nThis new version of the Mass. Numbers blog is enabled by some other new tools. The technologies of Rmarkdown, Distill, and GitHub Pages allow for creating data-driven blog posts that can be compiled into nice looking web pages, but also allow for including all of the data and analysis that appear in the post. This is exciting because it reduces the number of steps between analysis and publishing a result, but also because it promotes transparency, open data journalism, and reproducible data science.\nIf you read a post on this blog and are curious about how the analysis was done, you can look at the linked GitHub repository and see the .Rmd source of the post and the referenced data, checked in and versioned in the repository.\nOne other shout-out goes to the tmap mapping library that does Google Fusion Tables one better by making it easy to create data driven maps, both static maps and interactive maps, with a simple configuration option. The fact that I can create the maps completely with code allows for a great deal of automation, reducing the amount of manual work to create a map, and resulting in something that is documented and reproducible.\nI am guessing that most readers of this blog are interested in the political analysis and data visualizations, but I felt that it made sense to explain the evolution of the technology behind this writing and to help others who are interested in reproducing the results, or want to take the analysis in another direction.\nI am interested in your feedback. You can send me feedback through my @bwbensonjr twitter, or using the email address with username brent and the domain of this website.\n\n\n\n",
    "preview": "posts/welcome/welcome_files/figure-html5/city-town-map-1.png",
    "last_modified": "2022-08-21T19:31:26-04:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  }
]
